amigos/amigos/onvif/soap_msg.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns0="http://www.onvif.org/ver20/ptz/wsdl" xmlns:ns1="http://www.w3.org/2003/05/soap-envelope" xmlns:ns2="http://www.onvif.org/ver10/schema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"><SOAP-ENV:Header><wsse:Security mustUnderstand="true"><wsse:UsernameToken><wsse:Username>admin</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">fXatiZO9a6nhjXqv5xhvEq5ix2g=</wsse:Password><wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">MjExMDMyN2VkNWRkODk4YWFhNGExNjZlNTlmOTFhNjM=</wsse:Nonce><wsu:Created>2019-06-05T18:15:49.837419Z</wsu:Created></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><ns1:Body><ns0:ContinuousMove><ns0:ProfileToken>MediaProfile000</ns0:ProfileToken><ns0:Velocity><ns2:PanTilt x="0" y="-1.0"/></ns0:Velocity></ns0:ContinuousMove></ns1:Body></SOAP-ENV:Envelope>